Update flows
